app/controllers/civil_statuses_controller.rb

  def index
    @civil_statuses = CivilStatus.all
---
SELECT * FROM `civil_statuses`

  def show
    @civil_status = CivilStatus.find(params[:id])
---
SELECT * FROM `civil_statuses` WHERE (`civil_statuses`.`id` = 4) LIMIT 1

  def edit
    @civil_status = CivilStatus.find(params[:id])
---
SELECT * FROM `civil_statuses` WHERE (`civil_statuses`.`id` = 4)

  def create
   @civil_status = CivilStatus.create!(params[:civil_status])
    respond_to do |format|
      if @civil_status.save
---
INSERT INTO `civil_statuses` (`name`, `created_at`, `updated_at`, `gender`, `family_name`, `birthday`, `hometown`, `current_city`, `age`, `status`) VALUES('tiavina', '2010-03-26 14:49:16', '2010-03-26 14:49:16', 'femme', 'Rakotobe', '2010-03-26', '', '', 45, '')
UPDATE `civil_statuses` SET `updated_at` = '2010-04-18 06:03:11' WHERE `id` = 2

  def update
    @civil_status = CivilStatus.find(params[:id])
    respond_to do |format|
      if @civil_status.update_attributes(params[:civil_status])
---
SELECT * FROM `civil_statuses` WHERE (`civil_statuses`.`id` = 5)
UPDATE `civil_statuses` SET `updated_at` = '2010-04-15 09:10:11', `current_city` = 'Anatananarivo' WHERE `id` = 1

  def destroy
    @civil_status = CivilStatus.find(params[:id])
    @civil_status.destroy
---
SELECT * FROM `civil_statuses` WHERE (`civil_statuses`.`id` = 1)
DELETE FROM `civil_statuses` WHERE `id` = 1