app/controllers/compagnies_controller.rb

SELECT * FROM `compagnies`
---
  def index
    @compagnies = Compagny.all

SELECT * FROM `compagnies` WHERE (`compagnies`.`id` = 1)
---
  def show
    @compagny = Compagny.find(params[:id])

SELECT * FROM `compagnies` WHERE (`compagnies`.`id` = 1)
---
  def edit
    @compagny = Compagny.find(params[:id])

INSERT INTO `compagnies` (`name`, `created_at`, `updated_at`, `headquaters`, `activity`, `registration_number`, `legal_form`, `sector`) VALUES('COTONA', '2010-02-08 11:40:54', '2010-02-08 11:40:54', 'Antsirabe', 'producteur de textile', 12345, 'SA', 'textile /industrie')
---
  def create
    @compagny = Compagny.create!(params[:compagny])

SELECT * FROM `compagnies` WHERE (`compagnies`.`id` = 1)
UPDATE `compagnies` SET `updated_at` = '2010-02-10 14:26:01', `name` = 'COTONA1' WHERE `id` = 1
---
  def update
    @compagny = Compagny.find(params[:id])

    respond_to do |format|
      if @compagny.update_attributes(params[:compagny])