app/controllers/contact_infos_controller.rb

SELECT * FROM `contact_infos`
---
  def index
    @contact_infos = ContactInfo.all

SELECT * FROM `contact_infos` WHERE (`contact_infos`.`id` = 1)
---
  def show
    @contact_info = ContactInfo.find(params[:id])

SELECT * FROM `civil_statuses` LIMIT 1
---
  def new
    @contact_info = ContactInfo.new
    @contactable = CivilStatus.all

SELECT * FROM `contact_infos` WHERE (`contact_infos`.`id` = 1)
---
  def edit
    @contact_info = ContactInfo.find(params[:id])

INSERT INTO `contact_infos` (`contactable_type`, `localisation`, `created_at`, `contactable_id`, `updated_at`, `value_format`, `value`) VALUES(NULL, 'test', '2010-03-26 18:26:59', NULL, '2010-03-26 18:26:59', 1, 'anja@fen.com')
---
  def create
    @contact_info = ContactInfo.new(params[:contact_info])

    respond_to do |format|
      if @contact_info.save