app/controllers/firms_controller.rb

  def index
    @firms = Firm.all
---
SELECT * FROM `firms`

  def show
    @firm = Firm.find(params[:id])
---
SELECT * FROM `firms` WHERE (`firms`.`id` = 1)

  def create
    @firm = Firm.new(params[:firm])

    respond_to do |format|
      if @firm.save
---
INSERT INTO `firms` (`name`, `permalink`, `created_at`, `updated_at`, `baseline`, `description`) VALUES('SACIMEM', 'sacimem', '2009-11-11 05:01:20', '2009-11-11 05:01:20', 'Le tabac nuit à la santé', 'mpanamboatra sigara')