app/controllers/functions_controller.rb

  def index
    @functions = Function.all
---
SELECT * FROM `functions`

  def show
    @function = Function.find(params[:id])
---
SELECT * FROM `functions` WHERE (`functions`.`id` = 1)

  def create
    @function = Function.new(params[:function])

    respond_to do |format|
      if @function.save
---
INSERT INTO `functions` (`name`, `permalink`, `created_at`, `updated_at`) VALUES('Comptable', 'comptable', '2009-11-13 18:38:40', '2009-11-13 18:38:40')