app/controllers/job_sheets_controller.rb

SELECT * FROM `job_sheets`
---
  def index
    @job_sheets = JobSheet.all