app/controllers/localisations_controller.rb

SELECT * FROM `localisations`
---
  def index
    @localisations = Localisation.all

SELECT * FROM `localisations` WHERE (`localisations`.`id` = 1)
---
  def show
    @localisation = Localisation.find(params[:id])

INSERT INTO `localisations` (`name`, `permalink`, `created_at`, `updated_at`) VALUES('Antanananarivo', 'antananarivo', '2009-11-13 18:37:05', '2009-11-13 18:37:05')
---
  def create
    @localisation = Localisation.new(params[:localisation])

    respond_to do |format|
      if @localisation.save