app/controllers/offerings_controller.rb

SELECT * FROM `offerings`
---
  def index
    @offerings = Offering.all

SELECT * FROM `offerings` WHERE (`offerings`.`id` = 1)
---
  def show
    @offering = Offering.find(params[:id])

SELECT * FROM `firms` WHERE (`firms`.`id` = 1)
---
  def new
    if params[:firm_id]
      @firm = Firm.find(params[:firm_id])

SELECT * FROM `offerings` WHERE (`offerings`.`id` = 0)
---
  def edit
    @offering = Offering.find(params[:id])

INSERT INTO `offerings` (`permalink`, `on_line`, `created_at`, `title`, `updated_at`, `dead_line`, `description`, `firm_id`) VALUES('scretaire', '2009-03-12 15:27:00', '2009-11-12 15:29:06', 'Secretaire de direction', '2009-11-12 15:29:06', '2009-12-12 15:27:00', 'secretaire', NULL)
---
  def create
#    @firm = Firm.find(params[:firm_id])
#    @offering = @firm.offerings.new(params[:offering])
    @offering = Offering.new(params[:offering])

    respond_to do |format|
      if @offering.save

SELECT * FROM `offerings` WHERE (`offerings`.`id` = 3)
UPDATE `offerings` SET `updated_at` = '2009-11-12 15:54:54', `title` = 'sex every day', `permalink` = 'sex_sex', `description` = 'mlkjqsmdflk mqlsdkjlks fk qfslqkjfeziozuoizf em zfqlk sdlfk' WHERE `id` = 3
---
  def update
    @offering = Offering.find(params[:id])

    respond_to do |format|
      if @offering.update_attributes(params[:offering])

SELECT * FROM `offerings` WHERE (`offerings`.`id` = 1)
DELETE FROM `offerings` WHERE `id` = 1
---
  def destroy
    @offering = Offering.find(params[:id])
    @offering.destroy