app/controllers/offerings_controller.rb

  def create
    if params[:firm_id]
      @firm = Firm.find(params[:firm_id])
---
SELECT * FROM `firms` WHERE (`firms`.`id` = 2)