app/controllers/profiles_controller.rb

SELECT * FROM `profiles`
---
  def index
    @profiles = Profile.all

SELECT * FROM `profiles` WHERE (`profiles`.`id` = 1)
---
  def show
    @profile = Profile.find(params[:id])

SELECT * FROM `profiles` WHERE (`profiles`.`id` = 1)
---
  def edit
    @profile = Profile.find(params[:id])

INSERT INTO `profiles` (`name`, `created_at`, `updated_at`, `family_name`, `sex`, `birthday`, `town`) VALUES('fenom', '2009-11-10 08:00:49', '2009-11-10 08:00:49', 'Rakotonjanahary', 'femme', '2009-11-10', 'antsirabe')
---
  def create
    @profile = Profile.new(params[:profile])
      if @profile.save