app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2009-11-09 14:10:07', '80b441775301b93e51f0390e7eeaa83ef3092120d5fddd4dd03fa2b36027c5bce0ba99e9c0bb530f13be840dcebb98fee0ca4e8850c35737da68a358b88a50aa', '2009-11-09 14:10:07', 'test', 'g5jkgcjjh2KyecCrHuRc', 'af33727ac61a68e135b3c411556a13d830e2aec86cb5628a5af1306c0819cb132ba8015e4e08909502fa0a179c4fcf2ad448ec8bd03f3ea7c356b0a46c35e262', 'test@yahoo.fr')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @userp  = User.find(params[:id])

UPDATE `users` SET `updated_at` = '2009-11-10 12:26:10', `crypted_password` = '83dc6d64e6c8269bdec33a1dea0de2f3fa20aae54613309523cc2e5dad8b475bc086caeaf52a6f6eb85a418eeb4a75d07cdf94f8f44f0469f39b39e6d4022dff', `password_salt` = 'MWAbfNYqCTtlXtK9pMz-', `persistence_token` = 'd199654aaf80af0e766923825764dd47c42c7fd7ea3cc95242f5cc2a7bbfe9db9a37bf92a4601fa97a8f7be255b06a20fb018d02b6347bf034b1514e7116671b' WHERE `id` = 15
---
  def update
    @userp  = User.find(params[:id])
    @user = current_user
    if @userp.update_attributes(params[:user])